charliermarsh.ruff
dbaeumer.vscode-eslint
esbenp.prettier-vscode
foxundermoon.shell-format
github.copilot
github.copilot-chat
github.vscode-github-actions
google.geminicodeassist
mhutchie.git-graph
ms-python.debugpy
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
redhat.vscode-yaml
rust-lang.rust-analyzer
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
